# Taps
tap 'caskroom/cask-versions'
tap 'caskroom/cask-fonts'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'z'
brew 'direnv'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries/CLI tools
brew 'git'
brew 'hub'
brew 'tree'
brew 'trash'
brew 'wget'
brew 'dtrx'
brew 'bat'
brew 'tmux'
brew 'the_silver_searcher'
brew 'gpg'

# Development/Platforms
brew 'asdf'
cask 'anaconda'
brew 'yarn'

# Develoment Tools
brew 'csvkit'
brew 'neovim'
cask 'visual-studio-code'
cask 'github'
cask 'sourcetree'
cask 'postman'
cask 'dash'
cask 'docker'
cask 'nteract'
cask 'textmate'

# Database Tools
cask 'tableplus'
cask 'datagrip'

# Browsers
cask 'firefox'
cask 'google-chrome'

# File Management
cask 'google-backup-and-sync'
cask 'dropbox'

# Comms
cask 'slack'
cask 'whatsapp'
cask 'skype'

# Music
cask 'spotify'
cask 'lastfm'
cask 'spotmenu'

# Utilities
brew 'mackup'
cask 'iterm2'
cask 'aerial'
cask 'vlc'
cask 'the-unarchiver'
cask 'cloudapp'
cask 'itsycal'
cask 'daisydisk'
cask 'vnc-viewer'
cask 'evernote'
cask 'karabiner-elements'

# not for professional use
# cask 'utorrent'
# cask 'steam'
# cask 'sketch'
# cask 'sketch-toolbox'
# cask 'openemu'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'webpquicklook'
cask 'qlimagesize'

# Fonts
cask 'font-firacode-nerd-font'