# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'wget'

# Development
brew 'nvm'
cask 'anaconda'
cask 'atom'
cask 'visual-studio-code'
cask 'github-desktop'
cask 'sourcetree'
cask 'dotnet-sdk'

# Apps
cask 'aerial'
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'
cask 'shuttle'

cask 'slack'
cask 'whatsapp'

cask 'vlc'
cask 'the-unarchiver'
cask 'cloudapp'
cask 'itsycal'
cask 'daisydisk'
cask 'spotify'
cask 'skype'
cask 'lastfm'

# not for professional use
# cask 'utorrent'
# cask 'steam'
# cask 'sketch'
# cask 'sketch-toolbox'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'betterzipql'
cask 'webpquicklook'
cask 'qlimagesize'

# Install Mac App Store apps
#mas '1Password', id: 443987910
#mas 'Wunderlist', id: ?
#mas 'Disk Care', id: ?
<div id=""></div>

mas 'Unsplash Wallpapers', id: 1284863847
